{
  "message": {
    "home": {
      "compLing": "Компьютерная лингвистика",
      "link": "https://www.hse.ru/ma/ling/",
      "headline": "ChukchiType - Предиктивный ввод текста для чукотского языка",
      "heroText": "Мы студенты магистерской программы {0} в Высшей школе экономики и это сайт нашего проекта, посвященного исследованию способов нейросетевого моделирования малоресурсных языков. В современном NLP для задачи языкового моделирования создано уже достаточно много инструментов и архитектур, однако все они требуют качественных эммбедингов, для создания которых нужно большое количество обучающих данных. Именно поэтому для малоресурсных языков (таких языков, для которых существует мало оцифрованных текстов, либо вообще мало письменных текстов) невозможно создать хорошую нейросетевую языковую модель. Поэтому мы решили исследовать эффективность нового подхода для создания эммбедингов - алгоритма iiksin и сравнить качество языкового моделирования с использованием этого алгоритма и классических подходов. Основная цель нашего проекта заключалась в исследовании новых подходов для создания эммбедингов, а инструмент ChukchiType возник в ходе работы над экспериментами, когда перед нами встал вопрос об оценке качества языкового моделирования. Кроме того в работе над нашим проектом мы столкнулись с еще одной сложностью - строем чукотского языка. Чукотский относится к полисинтетическим языкам, что также осложняет использование стандартных алгоритмов постоения эмбедингов, основанных на контексте векторизуемого слова. В полисинтетических языках слова не похожи по своей структуре и форме на те, что есть в привычных нам синтетических (например, русский) или аналитических (например, английский) языках, из-за этого и подходы применяемые для этих языков, плохо работают на чукотском.",
      "learnMore": "Узнать больше"
    },
    "nav": {
      "home": "О проекте",
      "try": "Попробовать",
      "repo": "Репозиторий на GitHub"
    },
    "try": {
      "instructions": "Здесь вы можете протестировать работу нашей языковой модели. Для этого достаточно начать писать любое чукотское слово и модель предложит вам варинты продолжения фразы. Вы можете нажать на один из предложенных вариантов, либо написать что-то свое. Уверены, что вы знакомы с подобными механизмами, то же самое есть в вашем смартфоне в любом из мессенджеров, но для русского языка.",
      "placeholder": "Введите текст на чукотском",
      "getSuggestions": "Получить подсказки"
    },
    "research": {
      "headline": "Тензорное представление малоресурных полисинтетических языков",
      "authors": "Григорий Аршинов, Дарья Самсонова, Сергей Косяк, Михаил Воронов",
      "body": "Современные методы языкового моделирования плохо подходят для малоресурсных полисинтетических языков в связи с рядом причин. В нашей работе мы исследуем применение эммбедингов, построенных на алгоритме тензорного произведения с словесными сегментами. Результаты проведенных нами экспериментов показывают сравнительно лучшее качество языкового моделирования. Также мы рассказываем о построенном нами пайплайне и самой языковой модели, позволивших нам реализовать генерацию текста на чукотском языке, а также провести сравнение традиционных подходов с тем, что мы применили в своей работе. Мы использовали Neural Sequence Labeling Toolkit для создания модели сегментатора для чукотского языка, а также модель AWD-LSTM в качестве языковой модели на основе наших эммбедингов. Результаты экспериментов и подробное описание проведенных работ вы можете найти в статье.",
      "read": "Читать далее"
    }
  }
}